app/helpers/sessions_helper.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 762146114], ["LIMIT", 1]]
---
    def current_user
      if (user_id = session[:user_id])
        @current_user ||= User.find_by(id: user_id)
      elsif (user_id = cookies.signed[:user_id])
        raise
        user = User.find_by(id: user_id)