app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "sgrregthrth"], ["user_id", 1046959426], ["created_at", "2022-10-26 10:06:54.341264"], ["updated_at", "2022-10-26 10:06:54.341264"]]
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at", "picture") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "ghfdvv"], ["user_id", 1046959424], ["created_at", "2022-10-26 11:10:07.649337"], ["updated_at", "2022-10-26 11:10:07.649337"], ["picture", nil]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = $1  [["user_id", 1046959426]]
---
    def create
        @micropost = current_user.microposts.build(micropost_params)
        @micropost.picture.attach(params[:micropost][:picture])

        if @micropost.save
            flash[:success] = "Micropost created!"
            redirect_to root_url
        else
            @feed_items = current_user.feed.paginate(page: params[:page])