app/controllers/password_resets_controller.rb

  def update
      if params[:user][:password].empty?
          @user.errors.add(:password, "can't be empty")
          render 'edit'
      elsif @user.update(user_params)
---
UPDATE "users" SET "updated_at" = $1, "password_digest" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-10-24 21:21:01.847137"], ["password_digest", "[FILTERED]"], ["id", 1046959426]]

      def get_user
          @user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "3@mail.ru"], ["LIMIT", 1]]