app/models/user.rb

  def follow(other_user)
    active_relationships.create(followed_id: other_user.id)
---
INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 101], ["followed_id", 1], ["created_at", "2022-10-26 15:38:08.577530"], ["updated_at", "2022-10-26 15:38:08.577530"]]